# Pandas Crash Course for Data Science Assessments

**Date Created:** 20 January 2026

This comprehensive notebook covers essential Pandas concepts commonly tested in data science interviews and assessments. It includes teaching sections with clear explanations, practical examples, and practice questions with solutions.

## Table of Contents

1. [DataFrame Creation and Basic Operations](#1-dataframe-creation-and-basic-operations)
2. [Indexing and Selection](#2-indexing-and-selection)
3. [Merging and Joining](#3-merging-and-joining)
4. [GroupBy Operations and Aggregations](#4-groupby-operations-and-aggregations)
5. [Pivot Tables and Reshaping](#5-pivot-tables-and-reshaping)
6. [Apply, Map, and Lambda Functions](#6-apply-map-and-lambda-functions)
7. [Handling Missing Data](#7-handling-missing-data)
8. [String Operations](#8-string-operations)
9. [Date/Time Operations](#9-datetime-operations)
10. [Practice Questions](#10-practice-questions)

In [1]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)

---

## 1. DataFrame Creation and Basic Operations

A **DataFrame** is a two-dimensional, size-mutable, heterogeneous tabular data structure with labelled axes (rows and columns). It is the primary data structure in Pandas.

### Creating DataFrames

There are multiple ways to create a DataFrame:

In [2]:
# Method 1: From a dictionary
data_dict = {
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'age': [25, 30, 35, 28, 32],
    'city': ['London', 'Manchester', 'Birmingham', 'London', 'Leeds'],
    'salary': [50000, 60000, 75000, 55000, 65000]
}
df_from_dict = pd.DataFrame(data_dict)
print("DataFrame from dictionary:")
print(df_from_dict)

DataFrame from dictionary:
      name  age        city  salary
0    Alice   25      London   50000
1      Bob   30  Manchester   60000
2  Charlie   35  Birmingham   75000
3    Diana   28      London   55000
4      Eve   32       Leeds   65000

In [3]:
# Method 2: From a list of dictionaries
data_list = [
    {'product': 'Laptop', 'price': 999.99, 'quantity': 50},
    {'product': 'Mouse', 'price': 29.99, 'quantity': 200},
    {'product': 'Keyboard', 'price': 79.99, 'quantity': 150}
]
df_from_list = pd.DataFrame(data_list)
print("DataFrame from list of dictionaries:")
print(df_from_list)

DataFrame from list of dictionaries:
    product   price  quantity
0    Laptop  999.99        50
1     Mouse   29.99       200
2  Keyboard   79.99       150

In [4]:
# Method 3: From a NumPy array with custom index and columns
np_array = np.random.randint(1, 100, size=(4, 3))
df_from_numpy = pd.DataFrame(
    np_array,
    index=['row1', 'row2', 'row3', 'row4'],
    columns=['A', 'B', 'C']
)
print("DataFrame from NumPy array:")
print(df_from_numpy)

DataFrame from NumPy array:
       A   B   C
row1  87  78  79
row2  39  51  39
row3  43  73  60
row4  56  64   1

### Basic DataFrame Operations

In [5]:
# Create a sample DataFrame for demonstrations
employees = pd.DataFrame({
    'employee_id': [101, 102, 103, 104, 105, 106, 107, 108],
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace', 'Henry'],
    'department': ['Engineering', 'Sales', 'Engineering', 'HR', 'Sales', 'Engineering', 'HR', 'Sales'],
    'salary': [75000, 55000, 80000, 60000, 52000, 90000, 58000, 61000],
    'years_experience': [5, 3, 7, 4, 2, 10, 3, 5],
    'hire_date': pd.to_datetime(['2019-03-15', '2021-06-01', '2017-09-20', '2020-01-10', 
                                  '2022-05-25', '2014-11-08', '2021-08-15', '2019-12-01'])
})
print("Sample Employee DataFrame:")
print(employees)

Sample Employee DataFrame:
   employee_id     name   department  salary  years_experience  hire_date
0          101    Alice  Engineering   75000                 5 2019-03-15
1          102      Bob        Sales   55000                 3 2021-06-01
2          103  Charlie  Engineering   80000                 7 2017-09-20
3          104    Diana           HR   60000                 4 2020-01-10
4          105      Eve        Sales   52000                 2 2022-05-25
5          106    Frank  Engineering   90000                10 2014-11-08
6          107    Grace           HR   58000                 3 2021-08-15
7          108    Henry        Sales   61000                 5 2019-12-01

In [6]:
# View first n rows (default 5)
print("First 3 rows:")
print(employees.head(3))

First 3 rows:
   employee_id     name   department  salary  years_experience  hire_date
0          101    Alice  Engineering   75000                 5 2019-03-15
1          102      Bob        Sales   55000                 3 2021-06-01
2          103  Charlie  Engineering   80000                 7 2017-09-20

In [7]:
# View last n rows (default 5)
print("Last 2 rows:")
print(employees.tail(2))

Last 2 rows:
   employee_id   name department  salary  years_experience  hire_date
6          107  Grace         HR   58000                 3 2021-08-15
7          108  Henry      Sales   61000                 5 2019-12-01

In [8]:
# Get shape (rows, columns)
print(f"Shape: {employees.shape}")
print(f"Number of rows: {employees.shape[0]}")
print(f"Number of columns: {employees.shape[1]}")

Shape: (8, 6)
Number of rows: 8
Number of columns: 6

In [9]:
# Get column names and data types
print("Column names:")
print(employees.columns.tolist())
print("\nData types:")
print(employees.dtypes)

Column names:
['employee_id', 'name', 'department', 'salary', 'years_experience', 'hire_date']

Data types:
employee_id                  int64
name                        object
department                  object
salary                       int64
years_experience             int64
hire_date           datetime64[ns]
dtype: object

In [10]:
# Get summary information
print("DataFrame info:")
employees.info()

DataFrame info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       8 non-null      int64
 1   name              8 non-null      object
 2   department        8 non-null      object
 3   salary            8 non-null      int64
 4   years_experience  8 non-null      int64
 5   hire_date         8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 516.0+ bytes

In [11]:
# Descriptive statistics for numerical columns
print("Descriptive statistics:")
print(employees.describe())

Descriptive statistics:
       employee_id       salary  years_experience            hire_date
count      8.00000      8.00000          8.000000                    8
mean     104.50000  66375.00000          4.875000  2019-08-23 15:00:00
min      101.00000  52000.00000          2.000000  2014-11-08 00:00:00
25%      102.75000  57250.00000          3.000000  2018-10-30 18:00:00
50%      104.50000  60500.00000          4.500000  2019-12-21 00:00:00
75%      106.25000  76250.00000          5.500000  2021-06-19 18:00:00
max      108.00000  90000.00000         10.000000  2022-05-25 00:00:00
std        2.44949  13595.56125          2.587746                  NaN

In [12]:
# Unique values and value counts
print("Unique departments:")
print(employees['department'].unique())

print("\nDepartment value counts:")
print(employees['department'].value_counts())

Unique departments:
['Engineering' 'Sales' 'HR']

Department value counts:
department
Engineering    3
Sales          3
HR             2
Name: count, dtype: int64

---

## 2. Indexing and Selection

Pandas provides powerful ways to select and filter data using `.loc[]`, `.iloc[]`, and boolean indexing.

### `.loc[]` - Label-based Selection

Use `.loc[]` when you want to select by **row/column labels**.

In [13]:
# Set employee_id as index for better demonstration
df_indexed = employees.set_index('employee_id')
print("DataFrame with employee_id as index:")
print(df_indexed)

DataFrame with employee_id as index:
                name   department  salary  years_experience  hire_date
employee_id
101            Alice  Engineering   75000                 5 2019-03-15
102              Bob        Sales   55000                 3 2021-06-01
103          Charlie  Engineering   80000                 7 2017-09-20
104            Diana           HR   60000                 4 2020-01-10
105              Eve        Sales   52000                 2 2022-05-25
106            Frank  Engineering   90000                10 2014-11-08
107            Grace           HR   58000                 3 2021-08-15
108            Henry        Sales   61000                 5 2019-12-01

In [14]:
# Select a single row by label
print("Row for employee 103:")
print(df_indexed.loc[103])

Row for employee 103:
name                            Charlie
department                  Engineering
salary                            80000
years_experience                      7
hire_date           2017-09-20 00:00:00
Name: 103, dtype: object

In [15]:
# Select multiple rows by labels
print("Rows for employees 101, 103, 105:")
print(df_indexed.loc[[101, 103, 105]])

Rows for employees 101, 103, 105:
                name   department  salary  years_experience  hire_date
employee_id
101            Alice  Engineering   75000                 5 2019-03-15
103          Charlie  Engineering   80000                 7 2017-09-20
105              Eve        Sales   52000                 2 2022-05-25

In [16]:
# Select specific rows and columns
print("Name and salary for employees 102-104:")
print(df_indexed.loc[102:104, ['name', 'salary']])

Name and salary for employees 102-104:
                name  salary
employee_id
102              Bob   55000
103          Charlie   80000
104            Diana   60000

### `.iloc[]` - Integer Position-based Selection

Use `.iloc[]` when you want to select by **integer position** (0-indexed).

In [17]:
# Select first row
print("First row (position 0):")
print(employees.iloc[0])

First row (position 0):
employee_id                         101
name                              Alice
department                  Engineering
salary                            75000
years_experience                      5
hire_date           2019-03-15 00:00:00
Name: 0, dtype: object

In [18]:
# Select rows 1-3 and columns 0-2
print("Rows 1-3, columns 0-2:")
print(employees.iloc[1:4, 0:3])

Rows 1-3, columns 0-2:
   employee_id     name   department
1          102      Bob        Sales
2          103  Charlie  Engineering
3          104    Diana           HR

In [19]:
# Select specific rows and columns by position
print("Rows 0, 2, 4 and columns 1, 3:")
print(employees.iloc[[0, 2, 4], [1, 3]])

Rows 0, 2, 4 and columns 1, 3:
      name  salary
0    Alice   75000
2  Charlie   80000
4      Eve   52000

### Boolean Indexing

Filter rows based on conditions.

In [20]:
# Single condition
print("Employees with salary > 60000:")
print(employees[employees['salary'] > 60000])

Employees with salary > 60000:
   employee_id     name   department  salary  years_experience  hire_date
0          101    Alice  Engineering   75000                 5 2019-03-15
2          103  Charlie  Engineering   80000                 7 2017-09-20
5          106    Frank  Engineering   90000                10 2014-11-08
7          108    Henry        Sales   61000                 5 2019-12-01

In [21]:
# Multiple conditions with AND (&)
print("Engineering employees with salary > 70000:")
print(employees[(employees['department'] == 'Engineering') & (employees['salary'] > 70000)])

Engineering employees with salary > 70000:
   employee_id     name   department  salary  years_experience  hire_date
0          101    Alice  Engineering   75000                 5 2019-03-15
2          103  Charlie  Engineering   80000                 7 2017-09-20
5          106    Frank  Engineering   90000                10 2014-11-08

In [22]:
# Multiple conditions with OR (|)
print("Employees in HR or with experience > 5 years:")
print(employees[(employees['department'] == 'HR') | (employees['years_experience'] > 5)])

Employees in HR or with experience > 5 years:
   employee_id     name   department  salary  years_experience  hire_date
2          103  Charlie  Engineering   80000                 7 2017-09-20
3          104    Diana           HR   60000                 4 2020-01-10
5          106    Frank  Engineering   90000                10 2014-11-08
6          107    Grace           HR   58000                 3 2021-08-15

In [23]:
# Using isin() for multiple values
print("Employees in Engineering or Sales:")
print(employees[employees['department'].isin(['Engineering', 'Sales'])])

Employees in Engineering or Sales:
   employee_id     name   department  salary  years_experience  hire_date
0          101    Alice  Engineering   75000                 5 2019-03-15
1          102      Bob        Sales   55000                 3 2021-06-01
2          103  Charlie  Engineering   80000                 7 2017-09-20
4          105      Eve        Sales   52000                 2 2022-05-25
5          106    Frank  Engineering   90000                10 2014-11-08
7          108    Henry        Sales   61000                 5 2019-12-01

In [24]:
# Using query() method - more readable for complex conditions
print("Using query():")
print(employees.query('salary > 60000 and years_experience >= 4'))

Using query():
   employee_id     name   department  salary  years_experience  hire_date
0          101    Alice  Engineering   75000                 5 2019-03-15
2          103  Charlie  Engineering   80000                 7 2017-09-20
5          106    Frank  Engineering   90000                10 2014-11-08
7          108    Henry        Sales   61000                 5 2019-12-01

---

## 3. Merging and Joining

Pandas provides several methods to combine DataFrames: `merge()`, `join()`, and `concat()`.

### Creating Sample DataFrames for Merging

In [25]:
# Left DataFrame - Orders
orders = pd.DataFrame({
    'order_id': [1001, 1002, 1003, 1004, 1005],
    'customer_id': ['C001', 'C002', 'C001', 'C003', 'C004'],
    'product': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Headphones'],
    'amount': [999.99, 29.99, 79.99, 299.99, 149.99]
})
print("Orders DataFrame:")
print(orders)

Orders DataFrame:
   order_id customer_id     product  amount
0      1001        C001      Laptop  999.99
1      1002        C002       Mouse   29.99
2      1003        C001    Keyboard   79.99
3      1004        C003     Monitor  299.99
4      1005        C004  Headphones  149.99

In [26]:
# Right DataFrame - Customers
customers = pd.DataFrame({
    'customer_id': ['C001', 'C002', 'C003', 'C005'],
    'customer_name': ['John Smith', 'Jane Doe', 'Bob Wilson', 'Alice Brown'],
    'city': ['London', 'Manchester', 'Birmingham', 'Leeds']
})
print("Customers DataFrame:")
print(customers)

Customers DataFrame:
  customer_id customer_name        city
0        C001    John Smith      London
1        C002      Jane Doe  Manchester
2        C003    Bob Wilson  Birmingham
3        C005   Alice Brown       Leeds

### `merge()` - SQL-style Joins

The `merge()` function provides flexibility with different join types: `inner`, `left`, `right`, and `outer`.

In [27]:
# Inner join - only matching rows
inner_merged = pd.merge(orders, customers, on='customer_id', how='inner')
print("Inner Join (only matching customer_ids):")
print(inner_merged)

Inner Join (only matching customer_ids):
   order_id customer_id   product  amount customer_name        city
0      1001        C001    Laptop  999.99    John Smith      London
1      1002        C002     Mouse   29.99      Jane Doe  Manchester
2      1003        C001  Keyboard   79.99    John Smith      London
3      1004        C003   Monitor  299.99    Bob Wilson  Birmingham

In [28]:
# Left join - all rows from left DataFrame
left_merged = pd.merge(orders, customers, on='customer_id', how='left')
print("Left Join (all orders, matching customers):")
print(left_merged)

Left Join (all orders, matching customers):
   order_id customer_id     product  amount customer_name        city
0      1001        C001      Laptop  999.99    John Smith      London
1      1002        C002       Mouse   29.99      Jane Doe  Manchester
2      1003        C001    Keyboard   79.99    John Smith      London
3      1004        C003     Monitor  299.99    Bob Wilson  Birmingham
4      1005        C004  Headphones  149.99           NaN         NaN

In [29]:
# Right join - all rows from right DataFrame
right_merged = pd.merge(orders, customers, on='customer_id', how='right')
print("Right Join (all customers, matching orders):")
print(right_merged)

Right Join (all customers, matching orders):
   order_id customer_id   product  amount customer_name        city
0    1001.0        C001    Laptop  999.99    John Smith      London
1    1003.0        C001  Keyboard   79.99    John Smith      London
2    1002.0        C002     Mouse   29.99      Jane Doe  Manchester
3    1004.0        C003   Monitor  299.99    Bob Wilson  Birmingham
4       NaN        C005       NaN     NaN   Alice Brown       Leeds

In [30]:
# Outer join - all rows from both DataFrames
outer_merged = pd.merge(orders, customers, on='customer_id', how='outer')
print("Outer Join (all rows from both):")
print(outer_merged)

Outer Join (all rows from both):
   order_id customer_id     product  amount customer_name        city
0    1001.0        C001      Laptop  999.99    John Smith      London
1    1003.0        C001    Keyboard   79.99    John Smith      London
2    1002.0        C002       Mouse   29.99      Jane Doe  Manchester
3    1004.0        C003     Monitor  299.99    Bob Wilson  Birmingham
4    1005.0        C004  Headphones  149.99           NaN         NaN
5       NaN        C005         NaN     NaN   Alice Brown       Leeds

In [31]:
# Merge on different column names
orders_renamed = orders.rename(columns={'customer_id': 'cust_id'})
merged_diff_cols = pd.merge(orders_renamed, customers, left_on='cust_id', right_on='customer_id')
print("Merge with different column names:")
print(merged_diff_cols)

Merge with different column names:
   order_id cust_id   product  amount customer_id customer_name        city
0      1001    C001    Laptop  999.99        C001    John Smith      London
1      1002    C002     Mouse   29.99        C002      Jane Doe  Manchester
2      1003    C001  Keyboard   79.99        C001    John Smith      London
3      1004    C003   Monitor  299.99        C003    Bob Wilson  Birmingham

### `concat()` - Concatenating DataFrames

Use `concat()` to stack DataFrames vertically (axis=0) or horizontally (axis=1).

In [32]:
# Create two DataFrames to concatenate
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

# Vertical concatenation (stacking rows)
concat_vertical = pd.concat([df1, df2], ignore_index=True)
print("Vertical concatenation:")
print(concat_vertical)

Vertical concatenation:
   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [33]:
# Horizontal concatenation (stacking columns)
df3 = pd.DataFrame({'C': [9, 10], 'D': [11, 12]})
concat_horizontal = pd.concat([df1, df3], axis=1)
print("Horizontal concatenation:")
print(concat_horizontal)

Horizontal concatenation:
   A  B   C   D
0  1  3   9  11
1  2  4  10  12

---

## 4. GroupBy Operations and Aggregations

The `groupby()` function follows a **split-apply-combine** strategy:
1. **Split** the data into groups based on criteria
2. **Apply** a function to each group independently
3. **Combine** the results into a data structure

In [34]:
# Create a sales DataFrame for groupby examples
sales = pd.DataFrame({
    'date': pd.to_datetime(['2025-01-15', '2025-01-15', '2025-01-16', '2025-01-16',
                            '2025-01-17', '2025-01-17', '2025-01-18', '2025-01-18']),
    'store': ['London', 'Manchester', 'London', 'Manchester',
              'London', 'Manchester', 'London', 'Manchester'],
    'product': ['Electronics', 'Clothing', 'Electronics', 'Electronics',
                'Clothing', 'Clothing', 'Furniture', 'Furniture'],
    'revenue': [1500, 800, 2000, 1200, 600, 900, 3000, 2500],
    'units_sold': [10, 20, 15, 8, 15, 25, 5, 4]
})
print("Sales DataFrame:")
print(sales)

Sales DataFrame:
        date       store      product  revenue  units_sold
0 2025-01-15      London  Electronics     1500          10
1 2025-01-15  Manchester     Clothing      800          20
2 2025-01-16      London  Electronics     2000          15
3 2025-01-16  Manchester  Electronics     1200           8
4 2025-01-17      London     Clothing      600          15
5 2025-01-17  Manchester     Clothing      900          25
6 2025-01-18      London    Furniture     3000           5
7 2025-01-18  Manchester    Furniture     2500           4

In [35]:
# Basic groupby with single aggregation
print("Total revenue by store:")
print(sales.groupby('store')['revenue'].sum())

Total revenue by store:
store
London        7100
Manchester    5400
Name: revenue, dtype: int64

In [36]:
# Groupby with multiple aggregations using agg()
print("Multiple aggregations by store:")
store_stats = sales.groupby('store').agg({
    'revenue': ['sum', 'mean', 'max'],
    'units_sold': ['sum', 'mean']
})
print(store_stats)

Multiple aggregations by store:
           revenue               units_sold
               sum    mean   max        sum   mean
store
London        7100  1775.0  3000         45  11.25
Manchester    5400  1350.0  2500         57  14.25

In [37]:
# Named aggregations (cleaner column names)
print("Named aggregations:")
named_agg = sales.groupby('store').agg(
    total_revenue=('revenue', 'sum'),
    avg_revenue=('revenue', 'mean'),
    total_units=('units_sold', 'sum'),
    transaction_count=('revenue', 'count')
)
print(named_agg)

Named aggregations:
            total_revenue  avg_revenue  total_units  transaction_count
store
London               7100       1775.0           45                  4
Manchester           5400       1350.0           57                  4

In [38]:
# Groupby multiple columns
print("Revenue by store and product:")
multi_group = sales.groupby(['store', 'product'])['revenue'].sum().reset_index()
print(multi_group)

Revenue by store and product:
        store      product  revenue
0      London     Clothing      600
1      London  Electronics     3500
2      London    Furniture     3000
3  Manchester     Clothing     1700
4  Manchester  Electronics     1200
5  Manchester    Furniture     2500

In [39]:
# Custom aggregation function


def revenue_range(x: pd.Series) -> float:
    """Calculate the range of revenue values.
    
    Args:
        x: Series of revenue values.
    
    Returns:
        The difference between max and min values.
    """
    return x.max() - x.min()


print("Revenue range by store:")
print(sales.groupby('store')['revenue'].agg(revenue_range))

Revenue range by store:
store
London        2400
Manchester    1700
Name: revenue, dtype: int64

In [40]:
# Transform - apply function and return same-shaped result
print("Adding normalised revenue column:")
sales['revenue_normalised'] = sales.groupby('store')['revenue'].transform(
    lambda x: (x - x.mean()) / x.std()
)
print(sales[['store', 'revenue', 'revenue_normalised']])

Adding normalised revenue column:
        store  revenue  revenue_normalised
0      London     1500           -0.274657
1  Manchester      800           -0.700386
2      London     2000            0.224719
3  Manchester     1200           -0.191014
4      London      600           -1.173534
5  Manchester      900           -0.573043
6      London     3000            1.223472
7  Manchester     2500            1.464443

---

## 5. Pivot Tables and Reshaping

Pivot tables provide a way to summarise and reorganise data, similar to pivot tables in Excel.

In [41]:
# Remove the normalised column for cleaner examples
sales = sales.drop(columns=['revenue_normalised'])

# Basic pivot table
print("Pivot table - Revenue by store and product:")
pivot_basic = pd.pivot_table(
    sales,
    values='revenue',
    index='store',
    columns='product',
    aggfunc='sum'
)
print(pivot_basic)

Pivot table - Revenue by store and product:
product     Clothing  Electronics  Furniture
store
London           600         3500       3000
Manchester      1700         1200       2500

In [42]:
# Pivot table with multiple aggregations
print("Pivot table with sum and mean:")
pivot_multi = pd.pivot_table(
    sales,
    values='revenue',
    index='store',
    columns='product',
    aggfunc=['sum', 'mean'],
    fill_value=0
)
print(pivot_multi)

Pivot table with sum and mean:
                sum                           mean
product    Clothing Electronics Furniture Clothing Electronics Furniture
store
London          600        3500      3000    600.0      1750.0    3000.0
Manchester     1700        1200      2500    850.0      1200.0    2500.0

In [43]:
# Pivot table with margins (totals)
print("Pivot table with totals:")
pivot_margins = pd.pivot_table(
    sales,
    values='revenue',
    index='store',
    columns='product',
    aggfunc='sum',
    margins=True,
    margins_name='Total'
)
print(pivot_margins)

Pivot table with totals:
product     Clothing  Electronics  Furniture  Total
store
London           600         3500       3000   7100
Manchester      1700         1200       2500   5400
Total           2300         4700       5500  12500

### Reshaping with `melt()` and `stack()/unstack()`

In [44]:
# Create wide format data
wide_data = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'maths': [85, 90, 78],
    'english': [88, 82, 95],
    'science': [92, 88, 85]
})
print("Wide format:")
print(wide_data)

Wide format:
      name  maths  english  science
0    Alice     85       88       92
1      Bob     90       82       88
2  Charlie     78       95       85

In [45]:
# Melt - wide to long format
long_data = pd.melt(
    wide_data,
    id_vars=['name'],
    value_vars=['maths', 'english', 'science'],
    var_name='subject',
    value_name='score'
)
print("Long format (melted):")
print(long_data)

Long format (melted):
      name  subject  score
0    Alice    maths     85
1      Bob    maths     90
2  Charlie    maths     78
3    Alice  english     88
4      Bob  english     82
5  Charlie  english     95
6    Alice  science     92
7      Bob  science     88
8  Charlie  science     85

In [46]:
# Pivot - long to wide format
back_to_wide = long_data.pivot(index='name', columns='subject', values='score')
print("Back to wide format (pivoted):")
print(back_to_wide)

Back to wide format (pivoted):
subject  english  maths  science
name
Alice         88     85       92
Bob           82     90       88
Charlie       95     78       85

---

## 6. Apply, Map, and Lambda Functions

These functions allow you to apply custom transformations to your data.

In [47]:
# Sample DataFrame
df_apply = pd.DataFrame({
    'name': ['alice smith', 'bob jones', 'charlie brown'],
    'salary': [50000, 60000, 75000],
    'bonus_pct': [0.10, 0.15, 0.12]
})
print("Original DataFrame:")
print(df_apply)

Original DataFrame:
            name  salary  bonus_pct
0    alice smith   50000       0.10
1      bob jones   60000       0.15
2  charlie brown   75000       0.12

In [48]:
# apply() on a Series - applies function to each element
df_apply['name_title'] = df_apply['name'].apply(str.title)
print("After applying str.title:")
print(df_apply)

After applying str.title:
            name  salary  bonus_pct     name_title
0    alice smith   50000       0.10    Alice Smith
1      bob jones   60000       0.15      Bob Jones
2  charlie brown   75000       0.12  Charlie Brown

In [49]:
# apply() with lambda function
df_apply['total_compensation'] = df_apply.apply(
    lambda row: row['salary'] * (1 + row['bonus_pct']),
    axis=1
)
print("With total compensation:")
print(df_apply)

With total compensation:
            name  salary  bonus_pct     name_title  total_compensation
0    alice smith   50000       0.10    Alice Smith             55000.0
1      bob jones   60000       0.15      Bob Jones             69000.0
2  charlie brown   75000       0.12  Charlie Brown             84000.0

In [50]:
# map() - for Series, maps values using a dictionary or function
salary_bands = {
    50000: 'Junior',
    60000: 'Mid',
    75000: 'Senior'
}
df_apply['band'] = df_apply['salary'].map(salary_bands)
print("With salary bands mapped:")
print(df_apply)

With salary bands mapped:
            name  salary  bonus_pct     name_title  total_compensation    band
0    alice smith   50000       0.10    Alice Smith             55000.0  Junior
1      bob jones   60000       0.15      Bob Jones             69000.0     Mid
2  charlie brown   75000       0.12  Charlie Brown             84000.0  Senior

In [51]:
# Custom function with apply


def categorise_compensation(total_comp: float) -> str:
    """Categorise total compensation into bands.
    
    Args:
        total_comp: The total compensation value.
    
    Returns:
        Category string based on compensation level.
    """
    if total_comp < 60000:
        return 'Low'
    elif total_comp < 75000:
        return 'Medium'
    else:
        return 'High'


df_apply['comp_category'] = df_apply['total_compensation'].apply(categorise_compensation)
print("With compensation category:")
print(df_apply)

With compensation category:
            name  salary  bonus_pct     name_title  total_compensation  \
0    alice smith   50000       0.10    Alice Smith             55000.0
1      bob jones   60000       0.15      Bob Jones             69000.0
2  charlie brown   75000       0.12  Charlie Brown             84000.0

     band comp_category
0  Junior           Low
1     Mid        Medium
2  Senior          High

In [52]:
# applymap() / map() on DataFrame - applies to every element
# Note: applymap() is deprecated in newer pandas, use map() instead
numeric_df = pd.DataFrame({'A': [1.5, 2.3, 3.7], 'B': [4.2, 5.8, 6.1]})
rounded_df = numeric_df.map(lambda x: round(x))
print("Rounded DataFrame:")
print(rounded_df)

Rounded DataFrame:
   A  B
0  2  4
1  2  6
2  4  6

---

## 7. Handling Missing Data

Missing data is common in real-world datasets. Pandas uses `NaN` (Not a Number) and `None` to represent missing values.

In [53]:
# Create DataFrame with missing values
df_missing = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'age': [25, np.nan, 35, 28, np.nan],
    'city': ['London', 'Manchester', None, 'London', 'Leeds'],
    'salary': [50000, 60000, np.nan, np.nan, 65000]
})
print("DataFrame with missing values:")
print(df_missing)

DataFrame with missing values:
      name   age        city   salary
0    Alice  25.0      London  50000.0
1      Bob   NaN  Manchester  60000.0
2  Charlie  35.0        None      NaN
3    Diana  28.0      London      NaN
4      Eve   NaN       Leeds  65000.0

In [54]:
# Check for missing values
print("Is null (boolean mask):")
print(df_missing.isnull())

print("\nCount of missing values per column:")
print(df_missing.isnull().sum())

print("\nPercentage of missing values:")
print((df_missing.isnull().sum() / len(df_missing)) * 100)

Is null (boolean mask):
    name    age   city  salary
0  False  False  False   False
1  False   True  False   False
2  False  False   True    True
3  False  False  False    True
4  False   True  False   False

Count of missing values per column:
name      0
age       2
city      1
salary    2
dtype: int64

Percentage of missing values:
name       0.0
age       40.0
city      20.0
salary    40.0
dtype: float64

In [55]:
# Drop rows with any missing values
print("Drop rows with any NaN:")
print(df_missing.dropna())

Drop rows with any NaN:
    name   age    city   salary
0  Alice  25.0  London  50000.0

In [56]:
# Drop rows where specific column is missing
print("Drop rows where 'age' is NaN:")
print(df_missing.dropna(subset=['age']))

Drop rows where 'age' is NaN:
      name   age    city   salary
0    Alice  25.0  London  50000.0
2  Charlie  35.0    None      NaN
3    Diana  28.0  London      NaN

In [57]:
# Fill missing values with a constant
print("Fill all NaN with 'Unknown':")
print(df_missing.fillna('Unknown'))

Fill all NaN with 'Unknown':
      name      age        city   salary
0    Alice     25.0      London  50000.0
1      Bob  Unknown  Manchester  60000.0
2  Charlie     35.0     Unknown  Unknown
3    Diana     28.0      London  Unknown
4      Eve  Unknown       Leeds  65000.0

In [58]:
# Fill with different values per column
fill_values = {
    'age': df_missing['age'].mean(),
    'city': 'Unknown',
    'salary': df_missing['salary'].median()
}
df_filled = df_missing.fillna(fill_values)
print("Fill with column-specific values:")
print(df_filled)

Fill with column-specific values:
      name        age        city   salary
0    Alice  25.000000      London  50000.0
1      Bob  29.333333  Manchester  60000.0
2  Charlie  35.000000     Unknown  60000.0
3    Diana  28.000000      London  60000.0
4      Eve  29.333333       Leeds  65000.0

In [59]:
# Forward fill (propagate last valid value)
print("Forward fill:")
print(df_missing.ffill())

Forward fill:
      name   age        city   salary
0    Alice  25.0      London  50000.0
1      Bob  25.0  Manchester  60000.0
2  Charlie  35.0  Manchester  60000.0
3    Diana  28.0      London  60000.0
4      Eve  28.0       Leeds  65000.0

In [60]:
# Backward fill (propagate next valid value)
print("Backward fill:")
print(df_missing.bfill())

Backward fill:
      name   age        city   salary
0    Alice  25.0      London  50000.0
1      Bob  35.0  Manchester  60000.0
2  Charlie  35.0      London  65000.0
3    Diana  28.0      London  65000.0
4      Eve   NaN       Leeds  65000.0

In [61]:
# Interpolate missing values (for numeric columns)
df_numeric = pd.DataFrame({'values': [1.0, np.nan, np.nan, 4.0, 5.0, np.nan, 7.0]})
print("Original:")
print(df_numeric)
print("\nInterpolated:")
print(df_numeric.interpolate())

Original:
   values
0     1.0
1     NaN
2     NaN
3     4.0
4     5.0
5     NaN
6     7.0

Interpolated:
   values
0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0

---

## 8. String Operations

Pandas provides vectorised string operations through the `.str` accessor.

In [62]:
# Create DataFrame with string data
df_str = pd.DataFrame({
    'full_name': ['  John Smith  ', 'jane doe', 'BOB WILSON', 'Alice Brown-Jones'],
    'email': ['john@example.com', 'jane@test.co.uk', 'bob@sample.org', 'alice@demo.com'],
    'phone': ['020-1234-5678', '0161-987-6543', '0121-555-1234', '0113-222-3333']
})
print("Original DataFrame:")
print(df_str)

Original DataFrame:
           full_name             email          phone
0       John Smith    john@example.com  020-1234-5678
1           jane doe   jane@test.co.uk  0161-987-6543
2         BOB WILSON    bob@sample.org  0121-555-1234
3  Alice Brown-Jones    alice@demo.com  0113-222-3333

In [63]:
# Case transformations
print("Lowercase:")
print(df_str['full_name'].str.lower())

print("\nUppercase:")
print(df_str['full_name'].str.upper())

print("\nTitle case:")
print(df_str['full_name'].str.title())

Lowercase:
0         john smith
1             jane doe
2           bob wilson
3    alice brown-jones
Name: full_name, dtype: object

Uppercase:
0         JOHN SMITH
1             JANE DOE
2           BOB WILSON
3    ALICE BROWN-JONES
Name: full_name, dtype: object

Title case:
0         John Smith
1             Jane Doe
2           Bob Wilson
3    Alice Brown-Jones
Name: full_name, dtype: object

In [64]:
# Strip whitespace
print("Stripped whitespace:")
print(df_str['full_name'].str.strip())

Stripped whitespace:
0           John Smith
1             jane doe
2           BOB WILSON
3    Alice Brown-Jones
Name: full_name, dtype: object

In [65]:
# Split strings
df_str['first_name'] = df_str['full_name'].str.strip().str.split().str[0]
df_str['last_name'] = df_str['full_name'].str.strip().str.split().str[-1]
print("After splitting names:")
print(df_str[['full_name', 'first_name', 'last_name']])

After splitting names:
           full_name first_name    last_name
0       John Smith         John        Smith
1           jane doe       jane          doe
2         BOB WILSON        BOB       WILSON
3  Alice Brown-Jones      Alice  Brown-Jones

In [66]:
# Contains check (returns boolean)
print("Emails containing 'example':")
print(df_str[df_str['email'].str.contains('example')])

Emails containing 'example':
        full_name             email          phone first_name last_name
0    John Smith    john@example.com  020-1234-5678       John     Smith

In [67]:
# Replace strings
print("Replace '-' with space in phone:")
print(df_str['phone'].str.replace('-', ' '))

Replace '-' with space in phone:
0    020 1234 5678
1    0161 987 6543
2    0121 555 1234
3    0113 222 3333
Name: phone, dtype: object

In [68]:
# Extract using regex
print("Extract email domain:")
df_str['domain'] = df_str['email'].str.extract(r'@(.+)$')
print(df_str[['email', 'domain']])

Extract email domain:
              email       domain
0  john@example.com  example.com
1   jane@test.co.uk   test.co.uk
2    bob@sample.org   sample.org
3    alice@demo.com     demo.com

In [69]:
# String length
print("Email lengths:")
print(df_str['email'].str.len())

Email lengths:
0    16
1    15
2    14
3    14
Name: email, dtype: int64

In [70]:
# Starts with / Ends with
print("Names starting with 'J':")
print(df_str[df_str['full_name'].str.strip().str.lower().str.startswith('j')])

Names starting with 'J':
        full_name             email          phone first_name last_name  \
0    John Smith    john@example.com  020-1234-5678       John     Smith
1        jane doe   jane@test.co.uk  0161-987-6543       jane       doe

        domain
0  example.com
1   test.co.uk

---

## 9. Date/Time Operations

Pandas has excellent support for working with dates and times through the `datetime64` dtype and `.dt` accessor.

In [71]:
# Create DataFrame with datetime data
df_datetime = pd.DataFrame({
    'event': ['Meeting', 'Conference', 'Workshop', 'Presentation', 'Review'],
    'date_str': ['2025-01-15', '2025-02-20', '2025-03-10', '2025-04-05', '2025-05-25'],
    'timestamp': pd.to_datetime(['2025-01-15 09:30:00', '2025-02-20 14:00:00',
                                  '2025-03-10 10:00:00', '2025-04-05 15:30:00',
                                  '2025-05-25 11:00:00'])
})
print("DataFrame with datetime:")
print(df_datetime)
print("\nData types:")
print(df_datetime.dtypes)

DataFrame with datetime:
          event    date_str           timestamp
0       Meeting  2025-01-15 2025-01-15 09:30:00
1    Conference  2025-02-20 2025-02-20 14:00:00
2      Workshop  2025-03-10 2025-03-10 10:00:00
3  Presentation  2025-04-05 2025-04-05 15:30:00
4        Review  2025-05-25 2025-05-25 11:00:00

Data types:
event                object
date_str             object
timestamp    datetime64[ns]
dtype: object

In [72]:
# Convert string to datetime
df_datetime['date'] = pd.to_datetime(df_datetime['date_str'])
print("After conversion:")
print(df_datetime.dtypes)

After conversion:
event                object
date_str             object
timestamp    datetime64[ns]
date         datetime64[ns]
dtype: object

In [73]:
# Extract datetime components
df_datetime['year'] = df_datetime['timestamp'].dt.year
df_datetime['month'] = df_datetime['timestamp'].dt.month
df_datetime['day'] = df_datetime['timestamp'].dt.day
df_datetime['hour'] = df_datetime['timestamp'].dt.hour
df_datetime['day_name'] = df_datetime['timestamp'].dt.day_name()
df_datetime['month_name'] = df_datetime['timestamp'].dt.month_name()

print("Extracted components:")
print(df_datetime[['event', 'timestamp', 'year', 'month', 'day', 'hour', 'day_name']])

Extracted components:
          event           timestamp  year  month  day  hour   day_name
0       Meeting 2025-01-15 09:30:00  2025      1   15     9  Wednesday
1    Conference 2025-02-20 14:00:00  2025      2   20    14   Thursday
2      Workshop 2025-03-10 10:00:00  2025      3   10    10     Monday
3  Presentation 2025-04-05 15:30:00  2025      4    5    15   Saturday
4        Review 2025-05-25 11:00:00  2025      5   25    11     Sunday

In [74]:
# Date arithmetic
df_datetime['days_from_now'] = (df_datetime['timestamp'] - pd.Timestamp.now()).dt.days
print("Days from now:")
print(df_datetime[['event', 'timestamp', 'days_from_now']])

Days from now:
          event           timestamp  days_from_now
0       Meeting 2025-01-15 09:30:00           -375
1    Conference 2025-02-20 14:00:00           -339
2      Workshop 2025-03-10 10:00:00           -321
3  Presentation 2025-04-05 15:30:00           -295
4        Review 2025-05-25 11:00:00           -245

In [75]:
# Filter by date range
start_date = '2025-02-01'
end_date = '2025-04-30'
mask = (df_datetime['timestamp'] >= start_date) & (df_datetime['timestamp'] <= end_date)
print(f"Events between {start_date} and {end_date}:")
print(df_datetime.loc[mask, ['event', 'timestamp']])

Events between 2025-02-01 and 2025-04-30:
          event           timestamp
1    Conference 2025-02-20 14:00:00
2      Workshop 2025-03-10 10:00:00
3  Presentation 2025-04-05 15:30:00

In [76]:
# Create date range
date_range = pd.date_range(start='2025-01-01', periods=7, freq='D')
print("Date range (7 days):")
print(date_range)

Date range (7 days):
DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07'],
              dtype='datetime64[ns]', freq='D')

In [77]:
# Resample time series data
ts_data = pd.DataFrame({
    'date': pd.date_range(start='2025-01-01', periods=30, freq='D'),
    'sales': np.random.randint(100, 500, 30)
})
ts_data.set_index('date', inplace=True)

print("Weekly sum of sales:")
print(ts_data.resample('W').sum())

Weekly sum of sales:
            sales
date
2025-01-05   1891
2025-01-12   2382
2025-01-19   1661
2025-01-26   2198
2025-02-02   1066

In [78]:
# Rolling window calculations
ts_data['rolling_mean_7d'] = ts_data['sales'].rolling(window=7).mean()
print("With 7-day rolling mean:")
print(ts_data.head(10))

With 7-day rolling mean:
            sales  rolling_mean_7d
date
2025-01-01    451              NaN
2025-01-02    194              NaN
2025-01-03    455              NaN
2025-01-04    434              NaN
2025-01-05    357              NaN
2025-01-06    217              NaN
2025-01-07    297       343.571429
2025-01-08    347       328.714286
2025-01-09    166       324.714286
2025-01-10    372       312.857143

---

## 10. Practice Questions

Test your Pandas skills with these practice questions. Each question has a hidden solution that you can reveal after attempting it yourself.

In [87]:
# Create sample datasets for practice questions
np.random.seed(42)

# Employee dataset
employees_practice = pd.DataFrame({
    'employee_id': range(1, 21),
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace', 'Henry', 
             'Ivy', 'Jack', 'Kate', 'Leo', 'Mia', 'Noah', 'Olivia', 'Peter', 
             'Quinn', 'Rose', 'Sam', 'Tina'],
    'department': np.random.choice(['Engineering', 'Sales', 'HR', 'Marketing', 'Finance'], 20),
    'salary': np.random.randint(40000, 100000, 20),
    'years_experience': np.random.randint(1, 15, 20),
    'hire_date': pd.date_range(start='2015-01-01', periods=20, freq='120D'),
    'performance_score': np.random.choice([np.nan, 3.0, 3.5, 4.0, 4.5, 5.0], 20)
})

# Transactions dataset
transactions = pd.DataFrame({
    'transaction_id': range(1001, 1031),
    'employee_id': np.random.choice(range(1, 21), 30),
    'amount': np.random.uniform(50, 5000, 30).round(2),
    'category': np.random.choice(['Travel', 'Equipment', 'Training', 'Supplies', 'Software'], 30),
    'transaction_date': pd.date_range(start='2025-01-01', periods=30, freq='D')
})

print("Employees Dataset:")
print(employees_practice.head())
print(f"\nShape: {employees_practice.shape}")

print("\n" + "="*50)
print("\nTransactions Dataset:")
print(transactions.head())
print(f"\nShape: {transactions.shape}")

Employees Dataset:
   employee_id     name department  salary  years_experience  hire_date  \
0            1    Alice  Marketing   59769                 9 2015-01-01
1            2      Bob    Finance   68693                 3 2015-05-01
2            3  Charlie         HR   46396                 5 2015-08-29
3            4    Diana    Finance   67480                 3 2015-12-27
4            5      Eve    Finance   81434                 7 2016-04-25

   performance_score
0                4.0
1                4.0
2                4.0
3                4.5
4                3.5

Shape: (20, 7)

==================================================

Transactions Dataset:
   transaction_id  employee_id   amount  category transaction_date
0            1001           12  3867.79  Software       2025-01-01
1            1002            2   416.52  Training       2025-01-02
2            1003           10  1824.41  Software       2025-01-03
3            1004            4   623.55  Supplies       2025-01-04
4            1005           14  4322.36  Software       2025-01-05

Shape: (30, 5)

### Question 1: Basic Filtering

Find all employees in the Engineering department who have more than 5 years of experience. Display only the `name`, `department`, `salary`, and `years_experience` columns.

In [88]:
# Your solution here
employees_practice[(employees_practice['years_experience'] > 5) & (employees_practice['department'] == 'Engineering')][['name', 'department', 'salary', 'years_experience']]

Empty DataFrame
Columns: [name, department, salary, years_experience]
Index: []

<details>
<summary>Click to reveal answer</summary>

```python
result = employees_practice[
    (employees_practice['department'] == 'Engineering') & 
    (employees_practice['years_experience'] > 5)
][['name', 'department', 'salary', 'years_experience']]
print(result)
```

</details>

### Question 2: GroupBy with Multiple Aggregations

Calculate the following statistics for each department:
- Total number of employees
- Average salary
- Maximum years of experience
- Minimum salary

Sort the results by average salary in descending order.

In [90]:
# Your solution here
employees_practice.groupby('department').agg(
    total_number_of_employees=('name', 'count'), 
    average_salary=('salary', 'mean'), 
    maximum_years_of_experience=('years_experience', 'max'), 
    minimum_salary=('salary', 'min')
).sort_values('average_salary', ascending=False)

,total_number_of_employees,average_salary,maximum_years_of_experience,minimum_salary
department,,,,
Sales,3,72862.000000,9,59118
HR,5,71984.000000,12,46396
Marketing,5,69462.200000,10,41899
Finance,6,66238.166667,14,40189
Engineering,1,41267.000000,2,41267

<details>
<summary>Click to reveal answer</summary>

```python
dept_stats = employees_practice.groupby('department').agg(
    employee_count=('employee_id', 'count'),
    avg_salary=('salary', 'mean'),
    max_experience=('years_experience', 'max'),
    min_salary=('salary', 'min')
).sort_values('avg_salary', ascending=False)

print(dept_stats)
```

</details>

### Question 3: Merging DataFrames

Merge the `employees_practice` and `transactions` DataFrames to show each transaction along with the employee's name and department. Include all transactions even if the employee information is missing.

In [94]:
# Your solution here
pd.merge(transactions, employees_practice[['employee_id', 'name', 'department']], how = 'left', on='employee_id', validate=None)

,transaction_id,employee_id,amount,category,transaction_date,name,department
0,1001,12,3867.79,Software,2025-01-01,Leo,HR
1,1002,2,416.52,Training,2025-01-02,Bob,Finance
2,1003,10,1824.41,Software,2025-01-03,Jack,Finance
3,1004,4,623.55,Supplies,2025-01-04,Diana,Finance
4,1005,14,4322.36,Software,2025-01-05,Noah,Sales
5,1006,16,3135.33,Training,2025-01-06,Peter,Sales
6,1007,15,1687.95,Training,2025-01-07,Olivia,Marketing
7,1008,8,364.61,Supplies,2025-01-08,Henry,HR
8,1009,14,1589.36,Equipment,2025-01-09,Noah,Sales
9,1010,8,1659.66,Equipment,2025-01-10,Henry,HR
10,1011,16,3661.55,Software,2025-01-11,Peter,Sales
11,1012,13,3205.91,Travel,2025-01-12,Mia,Finance
12,1013,18,4441.70,Software,2025-01-13,Rose,Finance
13,1014,15,2387.46,Supplies,2025-01-14,Olivia,Marketing
14,1015,13,641.99,Supplies,2025-01-15,Mia,Finance
15,1016,9,3580.56,Supplies,2025-01-16,Ivy,HR
16,1017,15,3815.89,Supplies,2025-01-17,Olivia,Marketing
17,1018,13,2828.32,Supplies,2025-01-18,Mia,Finance
18,1019,1,3866.29,Training,2025-01-19,Alice,Marketing
19,1020,7,2494.29,Equipment,2025-01-20,Grace,HR
20,1021,9,2637.53,Supplies,2025-01-21,Ivy,HR
21,1022,1,2166.33,Travel,2025-01-22,Alice,Marketing
22,1023,12,175.82,Travel,2025-01-23,Leo,HR
23,1024,8,584.06,Travel,2025-01-24,Henry,HR
24,1025,11,205.57,Travel,2025-01-25,Kate,Marketing
25,1026,19,3200.23,Training,2025-01-26,Sam,Engineering
26,1027,17,1606.06,Travel,2025-01-27,Quinn,Marketing
27,1028,8,2567.42,Supplies,2025-01-28,Henry,HR
28,1029,3,4542.45,Software,2025-01-29,Charlie,HR
29,1030,3,1284.00,Travel,2025-01-30,Charlie,HR

<details>
<summary>Click to reveal answer</summary>

```python
merged_data = pd.merge(
    transactions,
    employees_practice[['employee_id', 'name', 'department']],
    on='employee_id',
    how='left'
)
print(merged_data.head(10))
```

</details>

### Question 4: Pivot Table

Create a pivot table showing the total transaction amount for each department and category combination. Include row and column totals.

In [96]:
# Your solution here
merge_df = pd.merge(transactions, employees_practice[['employee_id', 'department']], how = 'inner', on='employee_id', validate= None)

pd.pivot_table(
    merge_df, 
    values = 'amount', 
    index = 'department', 
    columns = 'category', 
    aggfunc = 'sum', 
    fill_value = 0,
    margins = True, 
    margins_name = 'Total'
)

category     Equipment  Software  Supplies  Training   Travel     Total
department
Engineering       0.00      0.00      0.00   3200.23     0.00   3200.23
Finance           0.00   6266.11   4093.86    416.52  3205.91  13982.40
HR             4153.95   8410.24   9150.12      0.00  2043.88  23758.19
Marketing         0.00      0.00   6203.35   5554.24  3977.96  15735.55
Sales          1589.36   7983.91      0.00   3135.33     0.00  12708.60
Total          5743.31  22660.26  19447.33  12306.32  9227.75  69384.97

<details>
<summary>Click to reveal answer</summary>

```python
# First merge to get department info
merged_for_pivot = pd.merge(
    transactions,
    employees_practice[['employee_id', 'department']],
    on='employee_id'
)

# Create pivot table
pivot_result = pd.pivot_table(
    merged_for_pivot,
    values='amount',
    index='department',
    columns='category',
    aggfunc='sum',
    fill_value=0,
    margins=True,
    margins_name='Total'
)
print(pivot_result.round(2))
```

</details>

### Question 5: Handling Missing Data

In the `employees_practice` DataFrame:
1. Count how many employees have missing `performance_score` values
2. Fill the missing `performance_score` values with the average score of their respective department
3. Show the employees who had missing scores (before and after filling)

In [105]:
# Your solution here
print(f"Missing Performance Score: {employees_practice['performance_score'].isnull().sum()}")

missing_mask = employees_practice['performance_score'].isnull()

print(employees_practice.loc[missing_mask, ['name', 'department', 'performance_score']])

employees_copy = employees_practice.copy()
employees_copy['performance_score'] = employees_copy.groupby('department')['performance_score'].transform(
    lambda x: x.fillna(x.mean())
)

print(employees_copy.loc[missing_mask, ['name', 'department', 'performance_score']])

Missing Performance Score: 1
    name department  performance_score
6  Grace         HR                NaN
    name department  performance_score
6  Grace         HR                4.0

<details>
<summary>Click to reveal answer</summary>

```python
# Count missing values
missing_count = employees_practice['performance_score'].isnull().sum()
print(f"Number of missing performance scores: {missing_count}")

# Identify employees with missing scores
missing_mask = employees_practice['performance_score'].isnull()
print("\nEmployees with missing scores:")
print(employees_practice.loc[missing_mask, ['name', 'department', 'performance_score']])

# Fill with department average using transform
employees_filled = employees_practice.copy()
employees_filled['performance_score'] = employees_filled.groupby('department')['performance_score'].transform(
    lambda x: x.fillna(x.mean())
)

print("\nAfter filling with department averages:")
print(employees_filled.loc[missing_mask, ['name', 'department', 'performance_score']])
```

</details>

### Question 6: Apply and Lambda Functions

Create a new column called `salary_band` in the `employees_practice` DataFrame that categorises employees as:
- 'Junior' if salary < 50000
- 'Mid' if salary >= 50000 and < 70000
- 'Senior' if salary >= 70000 and < 85000
- 'Lead' if salary >= 85000

Then show the count of employees in each salary band.

In [112]:
# Your solution here


def categorise_salary(salary: int) -> str:
    if salary < 50000:
        return 'Junior'
    elif salary >= 50000 and salary < 70000:
        return 'Mid'
    elif salary >= 70000 and salary < 85000:
        return 'Senior'
    else:
        return 'Lead'
    

employees_practice['salary_band'] = employees_practice['salary'].apply(categorise_salary)
employees_practice

,employee_id,name,department,salary,years_experience,hire_date,performance_score,salary_band
0,1,Alice,Marketing,59769,9,2015-01-01,4.0,Mid
1,2,Bob,Finance,68693,3,2015-05-01,4.0,Mid
2,3,Charlie,HR,46396,5,2015-08-29,4.0,Junior
3,4,Diana,Finance,67480,3,2015-12-27,4.5,Mid
4,5,Eve,Finance,81434,7,2016-04-25,3.5,Senior
5,6,Frank,Sales,65658,5,2016-08-23,5.0,Mid
6,7,Grace,HR,58942,9,2016-12-21,NaN,Mid
7,8,Henry,HR,97001,7,2017-04-20,4.0,Lead
8,9,Ivy,HR,58431,2,2017-08-18,3.0,Mid
9,10,Jack,Finance,42747,4,2017-12-16,4.0,Junior
10,11,Kate,Marketing,98319,9,2018-04-15,3.0,Lead
11,12,Leo,HR,99150,12,2018-08-13,5.0,Lead
12,13,Mia,Finance,40189,14,2018-12-11,5.0,Junior
13,14,Noah,Sales,59118,2,2019-04-10,5.0,Mid
14,15,Olivia,Marketing,75773,10,2019-08-08,3.0,Senior
15,16,Peter,Sales,93810,9,2019-12-06,4.0,Lead
16,17,Quinn,Marketing,41899,10,2020-04-04,5.0,Junior
17,18,Rose,Finance,96886,5,2020-08-02,4.5,Lead
18,19,Sam,Engineering,41267,2,2020-11-30,3.0,Junior
19,20,Tina,Marketing,71551,4,2021-03-30,3.0,Senior

<details>
<summary>Click to reveal answer</summary>

```python
def assign_salary_band(salary: int) -> str:
    """Assign a salary band based on salary value.
    
    Args:
        salary: The employee's salary.
    
    Returns:
        The salary band category.
    """
    if salary < 50000:
        return 'Junior'
    elif salary < 70000:
        return 'Mid'
    elif salary < 85000:
        return 'Senior'
    else:
        return 'Lead'

employees_practice['salary_band'] = employees_practice['salary'].apply(assign_salary_band)

print("Salary band distribution:")
print(employees_practice['salary_band'].value_counts())

print("\nSample of results:")
print(employees_practice[['name', 'salary', 'salary_band']].head(10))
```

</details>

### Question 7: String Operations

Using the transactions DataFrame, create a new column `category_code` that contains the first 3 letters of the category in uppercase. Then filter for transactions where the category code starts with 'TR'.

In [114]:
# Your solution here
transactions['category_code'] = transactions['category'].str[:3].str.upper()

transactions[transactions['category_code'].str.startswith('TR')]

,transaction_id,employee_id,amount,category,transaction_date,category_code
1,1002,2,416.52,Training,2025-01-02,TRA
5,1006,16,3135.33,Training,2025-01-06,TRA
6,1007,15,1687.95,Training,2025-01-07,TRA
11,1012,13,3205.91,Travel,2025-01-12,TRA
18,1019,1,3866.29,Training,2025-01-19,TRA
21,1022,1,2166.33,Travel,2025-01-22,TRA
22,1023,12,175.82,Travel,2025-01-23,TRA
23,1024,8,584.06,Travel,2025-01-24,TRA
24,1025,11,205.57,Travel,2025-01-25,TRA
25,1026,19,3200.23,Training,2025-01-26,TRA
26,1027,17,1606.06,Travel,2025-01-27,TRA
29,1030,3,1284.00,Travel,2025-01-30,TRA

<details>
<summary>Click to reveal answer</summary>

```python
transactions['category_code'] = transactions['category'].str[:3].str.upper()

print("All transactions with category codes:")
print(transactions[['transaction_id', 'category', 'category_code']].head(10))

print("\nTransactions where category starts with 'TR':")
tr_transactions = transactions[transactions['category_code'].str.startswith('TR')]
print(tr_transactions[['transaction_id', 'category', 'category_code', 'amount']])
```

</details>

### Question 8: Date/Time Operations

Using the `employees_practice` DataFrame:
1. Calculate how many days each employee has been with the company (from their hire date to today)
2. Find employees who were hired in the first quarter (January-March) of any year
3. Calculate the average tenure (in years) by department

In [120]:
# Your solution here
employees_copydt = employees_practice.copy()

employees_copydt['timeincompany'] = (pd.Timestamp.now() - employees_copydt['hire_date']).dt.days
employees_copydt['yearsincompany'] = employees_copydt['timeincompany'] / 365

print(employees_copydt[['name', 'timeincompany']])

print(employees_copydt[employees_copydt['hire_date'].dt.month.isin([1, 2, 3])])

print(employees_copydt.groupby('department')['yearsincompany'].mean().round(2))

       name  timeincompany
0     Alice           4041
1       Bob           3921
2   Charlie           3801
3     Diana           3681
4       Eve           3561
5     Frank           3441
6     Grace           3321
7     Henry           3201
8       Ivy           3081
9      Jack           2961
10     Kate           2841
11      Leo           2721
12      Mia           2601
13     Noah           2481
14   Olivia           2361
15    Peter           2241
16    Quinn           2121
17     Rose           2001
18      Sam           1881
19     Tina           1761
    employee_id   name department  salary  years_experience  hire_date  \
0             1  Alice  Marketing   59769                 9 2015-01-01
19           20   Tina  Marketing   71551                 4 2021-03-30

    performance_score salary_band  timeincompany  yearsincompany
0                 4.0         Mid           4041       11.071233
19                3.0      Senior           1761        4.824658
department
Engineering    5.15
Finance        8.55
HR             8.84
Marketing      7.19
Sales          7.45
Name: yearsincompany, dtype: float64

<details>
<summary>Click to reveal answer</summary>

```python
# Calculate days with company
today = pd.Timestamp.now()
employees_practice['days_employed'] = (today - employees_practice['hire_date']).dt.days
employees_practice['years_employed'] = employees_practice['days_employed'] / 365.25

print("Employee tenure:")
print(employees_practice[['name', 'hire_date', 'days_employed', 'years_employed']].head())

# Find Q1 hires
q1_hires = employees_practice[employees_practice['hire_date'].dt.month.isin([1, 2, 3])]
print("\nEmployees hired in Q1:")
print(q1_hires[['name', 'hire_date']])

# Average tenure by department
avg_tenure = employees_practice.groupby('department')['years_employed'].mean().round(2)
print("\nAverage tenure by department (years):")
print(avg_tenure.sort_values(ascending=False))
```

</details>

### Question 9: Complex Aggregation

For each employee, calculate:
1. Total transaction amount
2. Number of transactions
3. Average transaction amount
4. Most frequent transaction category

Then join this with the employee information to create a comprehensive view.

In [123]:
# Your solution here
transactions_summary = transactions.groupby('employee_id').agg(
    totalamount = ('amount', 'sum'),
    numberoftransaction = ('transaction_id', 'count'), 
    avgtransactionamount = ('amount', 'mean'), 
    frequenttransaction = ('category', lambda x: x.mode().iloc[0] if len(x.mode()) > 0 else None)
).reset_index()

pd.merge(
    employees_practice[['name', 'employee_id', 'department']], 
    transactions_summary, 
    how = 'inner', 
    on = 'employee_id', 
    validate = None
)

,name,employee_id,department,totalamount,numberoftransaction,avgtransactionamount,frequenttransaction
0,Alice,1,Marketing,6032.62,2,3016.310000,Training
1,Bob,2,Finance,416.52,1,416.520000,Training
2,Charlie,3,HR,5826.45,2,2913.225000,Software
3,Diana,4,Finance,623.55,1,623.550000,Supplies
4,Grace,7,HR,2494.29,1,2494.290000,Equipment
5,Henry,8,HR,5175.75,4,1293.937500,Supplies
6,Ivy,9,HR,6218.09,2,3109.045000,Supplies
7,Jack,10,Finance,1824.41,1,1824.410000,Software
8,Kate,11,Marketing,205.57,1,205.570000,Travel
9,Leo,12,HR,4043.61,2,2021.805000,Software
10,Mia,13,Finance,6676.22,3,2225.406667,Supplies
11,Noah,14,Sales,5911.72,2,2955.860000,Equipment
12,Olivia,15,Marketing,7891.30,3,2630.433333,Supplies
13,Peter,16,Sales,6796.88,2,3398.440000,Software
14,Quinn,17,Marketing,1606.06,1,1606.060000,Travel
15,Rose,18,Finance,4441.70,1,4441.700000,Software
16,Sam,19,Engineering,3200.23,1,3200.230000,Training

<details>
<summary>Click to reveal answer</summary>

```python
# Aggregate transaction data
transaction_summary = transactions.groupby('employee_id').agg(
    total_amount=('amount', 'sum'),
    transaction_count=('transaction_id', 'count'),
    avg_amount=('amount', 'mean'),
    most_frequent_category=('category', lambda x: x.mode().iloc[0] if len(x.mode()) > 0 else None)
).reset_index()

# Round the monetary values
transaction_summary['total_amount'] = transaction_summary['total_amount'].round(2)
transaction_summary['avg_amount'] = transaction_summary['avg_amount'].round(2)

# Merge with employee data
employee_transactions = pd.merge(
    employees_practice[['employee_id', 'name', 'department', 'salary']],
    transaction_summary,
    on='employee_id',
    how='left'
)

print("Employee Transaction Summary:")
print(employee_transactions)
```

</details>

### Question 10: Data Transformation Challenge

Create a summary report that shows:
1. For each department and salary band combination, show the count of employees and average performance score
2. Add a column showing what percentage of the department falls into each salary band
3. Sort by department and then by salary band

In [130]:
# Your solution here
summary_report = employees_practice.groupby(['department', 'salary_band']).agg(
    employeecount = ('employee_id', 'count'), 
    performancescoreavg = ('performance_score', 'mean')
).reset_index()

deptotal = summary_report.groupby('department')['employeecount'].transform('sum')
summary_report['percentageofdep'] = summary_report['employeecount'] / deptotal * 100

bandorder = ['Junior', 'Mid', 'Senior', 'Lead']
summary_report['salary_band'] = pd.Categorical(summary_report['salary_band'], categories=bandorder, ordered=True)
summary_report = summary_report.sort_values(['department', 'salary_band'])

summary_report['percentageofdep'] = summary_report['percentageofdep'].round(1)

summary_report

,department,salary_band,employeecount,performancescoreavg,percentageofdep
0,Engineering,Junior,1,3.00,100.0
1,Finance,Junior,2,4.50,33.3
3,Finance,Mid,2,4.25,33.3
4,Finance,Senior,1,3.50,16.7
2,Finance,Lead,1,4.50,16.7
5,HR,Junior,1,4.00,20.0
7,HR,Mid,2,3.00,40.0
6,HR,Lead,2,4.50,40.0
8,Marketing,Junior,1,5.00,20.0
10,Marketing,Mid,1,4.00,20.0
11,Marketing,Senior,2,3.00,40.0
9,Marketing,Lead,1,3.00,20.0
13,Sales,Mid,2,5.00,66.7
12,Sales,Lead,1,4.00,33.3

<details>
<summary>Click to reveal answer</summary>

```python
# Ensure salary_band column exists
if 'salary_band' not in employees_practice.columns:
    employees_practice['salary_band'] = employees_practice['salary'].apply(
        lambda x: 'Junior' if x < 50000 else ('Mid' if x < 70000 else ('Senior' if x < 85000 else 'Lead'))
    )

# Fill missing performance scores for this analysis
df_analysis = employees_practice.copy()
df_analysis['performance_score'] = df_analysis.groupby('department')['performance_score'].transform(
    lambda x: x.fillna(x.mean())
)

# Group by department and salary band
summary = df_analysis.groupby(['department', 'salary_band']).agg(
    employee_count=('employee_id', 'count'),
    avg_performance=('performance_score', 'mean')
).reset_index()

# Calculate department totals for percentage
dept_totals = summary.groupby('department')['employee_count'].transform('sum')
summary['pct_of_department'] = (summary['employee_count'] / dept_totals * 100).round(1)

# Round performance score
summary['avg_performance'] = summary['avg_performance'].round(2)

# Sort by department and salary band
band_order = ['Junior', 'Mid', 'Senior', 'Lead']
summary['salary_band'] = pd.Categorical(summary['salary_band'], categories=band_order, ordered=True)
summary = summary.sort_values(['department', 'salary_band'])

print("Department and Salary Band Summary:")
print(summary.to_string(index=False))
```

</details>

### Question 11: Window Functions

Using the transactions DataFrame:
1. Add a column showing the running total of transaction amounts (cumulative sum)
2. Add a column showing the 3-day rolling average of transaction amounts
3. Add a column showing the rank of each transaction by amount within each category

In [131]:
# Your solution here
transactions['cumulative_sum'] = transactions['amount'].cumsum()
transactions['3-day_rolling'] = transactions['amount'].rolling(window=3).mean()
transactions['rank'] = transactions.groupby('category')['amount'].rank(
    method='dense', ascending=False
).astype(int)

transactions

,transaction_id,employee_id,amount,category,transaction_date,category_code,cumulative_sum,3-day_rolling,rank
0,1001,12,3867.79,Software,2025-01-01,SOF,3867.79,NaN,4
1,1002,2,416.52,Training,2025-01-02,TRA,4284.31,NaN,5
2,1003,10,1824.41,Software,2025-01-03,SOF,6108.72,2036.240000,6
3,1004,4,623.55,Supplies,2025-01-04,SUP,6732.27,954.826667,8
4,1005,14,4322.36,Software,2025-01-05,SOF,11054.63,2256.773333,3
5,1006,16,3135.33,Training,2025-01-06,TRA,14189.96,2693.746667,3
6,1007,15,1687.95,Training,2025-01-07,TRA,15877.91,3048.546667,4
7,1008,8,364.61,Supplies,2025-01-08,SUP,16242.52,1729.296667,9
8,1009,14,1589.36,Equipment,2025-01-09,EQU,17831.88,1213.973333,3
9,1010,8,1659.66,Equipment,2025-01-10,EQU,19491.54,1204.543333,2
10,1011,16,3661.55,Software,2025-01-11,SOF,23153.09,2303.523333,5
11,1012,13,3205.91,Travel,2025-01-12,TRA,26359.00,2842.373333,1
12,1013,18,4441.70,Software,2025-01-13,SOF,30800.70,3769.720000,2
13,1014,15,2387.46,Supplies,2025-01-14,SUP,33188.16,3345.023333,6
14,1015,13,641.99,Supplies,2025-01-15,SUP,33830.15,2490.383333,7
15,1016,9,3580.56,Supplies,2025-01-16,SUP,37410.71,2203.336667,2
16,1017,15,3815.89,Supplies,2025-01-17,SUP,41226.60,2679.480000,1
17,1018,13,2828.32,Supplies,2025-01-18,SUP,44054.92,3408.256667,3
18,1019,1,3866.29,Training,2025-01-19,TRA,47921.21,3503.500000,1
19,1020,7,2494.29,Equipment,2025-01-20,EQU,50415.50,3062.966667,1
20,1021,9,2637.53,Supplies,2025-01-21,SUP,53053.03,2999.370000,4
21,1022,1,2166.33,Travel,2025-01-22,TRA,55219.36,2432.716667,2
22,1023,12,175.82,Travel,2025-01-23,TRA,55395.18,1659.893333,7
23,1024,8,584.06,Travel,2025-01-24,TRA,55979.24,975.403333,5
24,1025,11,205.57,Travel,2025-01-25,TRA,56184.81,321.816667,6
25,1026,19,3200.23,Training,2025-01-26,TRA,59385.04,1329.953333,2
26,1027,17,1606.06,Travel,2025-01-27,TRA,60991.10,1670.620000,3
27,1028,8,2567.42,Supplies,2025-01-28,SUP,63558.52,2457.903333,5
28,1029,3,4542.45,Software,2025-01-29,SOF,68100.97,2905.310000,1
29,1030,3,1284.00,Travel,2025-01-30,TRA,69384.97,2797.956667,4

<details>
<summary>Click to reveal answer</summary>

```python
# Sort by date first
transactions_sorted = transactions.sort_values('transaction_date').copy()

# Running total (cumulative sum)
transactions_sorted['running_total'] = transactions_sorted['amount'].cumsum().round(2)

# 3-day rolling average
transactions_sorted['rolling_avg_3d'] = transactions_sorted['amount'].rolling(window=3).mean().round(2)

# Rank within each category
transactions_sorted['rank_in_category'] = transactions_sorted.groupby('category')['amount'].rank(
    method='dense', ascending=False
).astype(int)

print("Transactions with window functions:")
print(transactions_sorted[['transaction_date', 'category', 'amount', 
                           'running_total', 'rolling_avg_3d', 'rank_in_category']].head(15))
```

</details>

### Question 12: Data Cleaning Challenge

Given the following messy DataFrame, clean it by:
1. Standardising the name format (title case, stripped whitespace)
2. Fixing the salary column (remove currency symbols and commas, convert to numeric)
3. Standardising the department names (consistent capitalisation)
4. Converting the date column to datetime format

In [138]:
# Messy DataFrame to clean
messy_data = pd.DataFrame({
    'name': ['  john smith  ', 'JANE DOE', 'bob Wilson', '  alice BROWN  '],
    'salary': ['50,000', '65,000', '45000', '72,500'],
    'department': ['engineering', 'SALES', 'Engineering', 'sales'],
    'start_date': ['01/03/2020', '15-06-2021', '10/01/2022', '01-12-2019']
})
print("Messy data:")
print(messy_data)

# Your solution here
messy_data['name'] = messy_data['name'].str.title().str.strip()
messy_data['salary'] = pd.to_numeric(messy_data['salary'].str.replace('', '').str.replace(',', ''))
messy_data['department'] = messy_data['department'].str.title()
messy_data['start_date'] = pd.to_datetime(messy_data['start_date'].str.replace('/', '-'), dayfirst = True)

messy_data

Messy data:
              name   salary   department  start_date
0     john smith    50,000  engineering  01/03/2020
1         JANE DOE  65,000        SALES  15-06-2021
2       bob Wilson    45000  Engineering  10/01/2022
3    alice BROWN    72,500        sales  01-12-2019

          name  salary   department start_date
0   John Smith   50000  Engineering 2020-03-01
1     Jane Doe   65000        Sales 2021-06-15
2   Bob Wilson   45000  Engineering 2022-01-10
3  Alice Brown   72500        Sales 2019-12-01

<details>
<summary>Click to reveal answer</summary>

```python
clean_data = messy_data.copy()

# Standardise names
clean_data['name'] = clean_data['name'].str.strip().str.title()

# Fix salary - remove  and commas, convert to numeric
clean_data['salary'] = clean_data['salary'].str.replace('', '', regex=False)
clean_data['salary'] = clean_data['salary'].str.replace(',', '', regex=False)
clean_data['salary'] = pd.to_numeric(clean_data['salary'])

# Standardise department names
clean_data['department'] = clean_data['department'].str.strip().str.title()

# Convert dates - handle mixed formats
clean_data['start_date'] = pd.to_datetime(clean_data['start_date'], dayfirst=True)

print("Cleaned data:")
print(clean_data)
print("\nData types:")
print(clean_data.dtypes)
```

</details>

---

## Summary

This notebook covered the essential Pandas concepts commonly tested in data science assessments:

1. **DataFrame Creation** - Multiple methods to create DataFrames from dictionaries, lists, and arrays
2. **Indexing and Selection** - Using `.loc[]`, `.iloc[]`, and boolean indexing for data access
3. **Merging and Joining** - Combining DataFrames with `merge()`, `join()`, and `concat()`
4. **GroupBy Operations** - Split-apply-combine pattern with aggregations
5. **Pivot Tables** - Reshaping data for analysis and reporting
6. **Apply and Lambda** - Custom transformations on data
7. **Missing Data** - Detection, removal, and imputation strategies
8. **String Operations** - Vectorised string manipulation with `.str` accessor
9. **Date/Time Operations** - Working with temporal data using `.dt` accessor

### Key Tips for Assessments

- Always check data types with `.dtypes` before operations
- Use `.shape` and `.info()` to understand your data structure
- Prefer vectorised operations over loops for better performance
- Use `copy()` when you need to modify a DataFrame without affecting the original
- Remember that `.loc[]` uses labels and `.iloc[]` uses integer positions
- Use parentheses around each condition in boolean indexing with `&` and `|`

### Additional Resources

- [Pandas Official Documentation](https://pandas.pydata.org/docs/)
- [Pandas Cheat Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)